@inline Ψ(::Val{0}, ξ) = 1
@inline Ψ(::Val{1}, ξ) = 2ξ - 1
@inline Ψ(::Val{2}, ξ) = 6ξ^2 - 6ξ + 1
@inline Ψ(::Val{3}, ξ) = 20ξ^3 - 30ξ^2 + 12ξ - 1
@inline Ψ(::Val{4}, ξ) = 70ξ^4 - 140ξ^3 + 90ξ^2 - 20ξ + 1
@inline Ψ(::Val{5}, ξ) = 252ξ^5 - 630ξ^4 + 560ξ^3 - 210ξ^2 + 30ξ - 1

@inline ∫Ψ(::Val{0}, ξ) = 1
@inline ∫Ψ(::Val{1}, ξ) = ξ^2 - ξ
@inline ∫Ψ(::Val{2}, ξ) = 2ξ^3 - 3ξ^2 + ξ
@inline ∫Ψ(::Val{3}, ξ) = 5ξ^4 - 10ξ^3 + 6ξ^2 - ξ
@inline ∫Ψ(::Val{4}, ξ) = 14ξ^5 - 35ξ^4 + 30ξ^3 - 10ξ^2 + ξ
@inline ∫Ψ(::Val{5}, ξ) = 42ξ^6 - 126ξ^5 + 140ξ^4 - 70ξ^3 + 15ξ^2 - ξ

@inline ψψ(::Val{0}, ::Val{0}, ξ) = 1
@inline ψψ(::Val{0}, ::Val{1}, ξ) = 2ξ - 1
@inline ψψ(::Val{1}, ::Val{0}, ξ) = 2ξ - 1
@inline ψψ(::Val{1}, ::Val{1}, ξ) = 4ξ^2 - 4ξ + 1
@inline ψψ(::Val{1}, ::Val{2}, ξ) = 12ξ^3 - 18ξ + 8ξ -1
@inline ψψ(::Val{2}, ::Val{1}, ξ) = 12ξ^3 - 18ξ + 8ξ -1
@inline ψψ(::Val{2}, ::Val{2}, ξ) = 36ξ^4 - 72ξ^3 + 36ξ^2 - 4ξ

